<?php
/**
 * Created by PhpStorm.
 * User: it-iguxa
 * Date: 2018-08-27
 * Time: 15:14
 */


//функция для удаление в сторке более одной скобочки
function sad_clown($str)
{
    $pattern = '/[)]+/';
    $replace = ')';
    $sad = preg_replace($pattern, $replace, $str);
    return $sad;
}

$str = "Товарищи!:)))))) консультация:)))))) с широким :))))))активом позволяет выполнять важные задания по разработке позиций,:)))))) занимаемых участниками в отношении поставленных задач.:)))))) Разнообразный и богатый опыт дальнейшее:)))))) развитие различных форм деятельности позволяет оценить значение:)))))) модели развития.";


echo sad_clown($str);